rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	fx_status = fx_file_read(model_file_ptr, source_bytes,
			APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS)
			|| (bytes_read != APP_AI_XSPI2_PROBE_BYTES)) {
		DebugConsole_Printf(
				"[AI] xSPI2 source prefix read failed (fx=%lu n=%lu).\r\n",
				(unsigned long) fx_status, (unsigned long) bytes_read);
		return false;
	}

	AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_bytes);

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS) {
		DebugConsole_Printf(
				"[AI] xSPI2 source rewind failed (fx=%lu).\r\n",
				(unsigned long) fx_status);
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesFlash(void) {
	if (!AppAI_Xspi2ReadFlashProbe(0U, app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at start signature.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_SCALE_OFFSET,
			app_ai_xspi2_signature_scale,
			sizeof(app_ai_xspi2_signature_scale))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at scale signature.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_ZERO_POINT_OFFSET,
			app_ai_xspi2_signature_zero_point,
			sizeof(app_ai_xspi2_signature_zero_point))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at zero-point byte.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadFlashProbe(
			APP_AI_XSPI2_MODEL_IMAGE_SIZE - APP_AI_XSPI2_PROBE_BYTES,
			app_ai_xspi2_signature_tail,
			sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesMappedFlash(void) {
	if (!AppAI_Xspi2ReadMappedProbe(0U, app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at start signature.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadMappedProbe(APP_AI_XSPI2_SCALE_OFFSET,
			app_ai_xspi2_signature_scale,
			sizeof(app_ai_xspi2_signature_scale))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at scale signature.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadMappedProbe(APP_AI_XSPI2_ZERO_POINT_OFFSET,
			app_ai_xspi2_signature_zero_point,
			sizeof(app_ai_xspi2_signature_zero_point))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at zero-point byte.\r\n");
		return false;
	}

	if (!AppAI_Xspi2ReadMappedProbe(
			APP_AI_XSPI2_MODEL_IMAGE_SIZE - APP_AI_XSPI2_PROBE_BYTES,
			app_ai_xspi2_signature_tail,
			sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_ProgramXspi2ModelImageFromSd(void) {
	FX_MEDIA *media_ptr = NULL;
	FX_FILE model_file = { 0 };
	ULONG file_size = 0U;
	ULONG bytes_read = 0U;
	ULONG bytes_remaining = 0U;
	ULONG flash_offset = 0U;
	UINT fx_status = FX_SUCCESS;
	UINT tx_status = TX_SUCCESS;
	int32_t bsp_status = BSP_ERROR_NONE;

	if (!AppAI_WaitForFileXMediaReady(APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS)) {
		AppAI_LogXspi2LoadFailure("FileX not ready", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	tx_status = AppFileX_AcquireMediaLock();
	if (tx_status != TX_SUCCESS) {
		AppAI_LogXspi2LoadFailure("media lock", (UINT) tx_status, BSP_ERROR_NONE);
		return false;
	}

	media_ptr = AppFileX_GetMediaHandle();
	if (media_ptr == NULL) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("media handle", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	if (fx_directory_default_set(media_ptr, FX_NULL) != FX_SUCCESS) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("default directory", FX_SUCCESS,
				BSP_ERROR_NONE);
		return false;
	}

	fx_status = fx_file_open(media_ptr, &model_file,
			(CHAR *) APP_AI_XSPI2_MODEL_IMAGE_PATH, FX_OPEN_FOR_READ);
	if (fx_status != FX_SUCCESS) {
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file open", fx_status, BSP_ERROR_NONE);
		return false;
	}

	file_size = model_file.fx_file_current_file_size;
	if (file_size != APP_AI_XSPI2_MODEL_IMAGE_SIZE) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file size", FX_SUCCESS, BSP_ERROR_NONE);
		return false;
	}

	fx_status = fx_file_seek(&model_file, 0U);
	if (fx_status != FX_SUCCESS) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file seek", fx_status, BSP_ERROR_NONE);
		return false;
	}

	if (!AppAI_LogXspi2ModelFilePrefix(&model_file)) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("source prefix", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	for (ULONG erase_addr = 0U; erase_addr < file_size;
			erase_addr += APP_AI_XSPI2_ERASE_BLOCK_BYTES) {
		bsp_status = BSP_XSPI_NOR_Erase_Block(0U, erase_addr,
				BSP_XSPI_NOR_ERASE_64K);
		if (bsp_status != BSP_ERROR_NONE) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("flash erase", FX_SUCCESS, bsp_status);
			return false;
		}
	}

	bytes_remaining = file_size;
	flash_offset = 0U;
	{
		ULONG chunk_index = 0U;

	while (bytes_remaining > 0U) {
		const ULONG chunk_size = (bytes_remaining > APP_AI_XSPI2_PROGRAM_CHUNK_BYTES)
				? APP_AI_XSPI2_PROGRAM_CHUNK_BYTES
				: bytes_remaining;

		if ((flash_offset == 0U)
				|| ((flash_offset % APP_AI_XSPI2_ERASE_BLOCK_BYTES) == 0U)) {
			AppAI_LogXspi2ProgramChunkProgress(chunk_index, flash_offset,
					chunk_size);
		}

		bytes_read = 0U;
		fx_status = fx_file_read(&model_file, app_ai_xspi2_program_buffer,
				chunk_size, &bytes_read);
		if ((fx_status != FX_SUCCESS) || (bytes_read != chunk_size)) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("file read", fx_status, BSP_ERROR_NONE);
			return false;
		}

		bsp_status = BSP_XSPI_NOR_Write(0U, app_ai_xspi2_program_buffer,
				flash_offset, (uint32_t) chunk_size);
		if (bsp_status != BSP_ERROR_NONE) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("flash write", FX_SUCCESS, bsp_status);
			return false;
		}

		flash_offset += chunk_size;
		bytes_remaining -= chunk_size;
		chunk_index++;
	}
	}

