rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	(void) fx_file_close(&model_file);
	(void) fx_directory_default_set(media_ptr, FX_NULL);
	AppFileX_ReleaseMediaLock();

	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	AppAI_LogXspi2IndirectAndMappedPrefix();
	AppAI_LogXspi2MappedScaleBytes();

	return true;
}

static bool AppAI_WaitForFileXMediaReady(uint32_t timeout_ms) {
	const ULONG timeout_ticks = (ULONG) ((timeout_ms + 9U) / 10U);
	const ULONG start_tick = tx_time_get();

	while (!AppFileX_IsMediaReady()) {
		if ((tx_time_get() - start_tick) >= timeout_ticks) {
			return false;
		}

		tx_thread_sleep(1U);
	}

	return true;
}

static bool AppAI_EnsureXspi2ModelImageReady(void) {
	if (app_ai_xspi2_initialized) {
		return true;
	}

	/* The runtime consumes the blob through the mapped xSPI2 window, so verify
	 * that view first. Some boots leave the indirect probe path in a misleading
	 * state even when the programmed image is still present. */
	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	if (AppAI_Xspi2ModelImageMatchesMappedFlash()) {
		DebugConsole_Printf(
				"[AI] xSPI2 model image already present; skipping provisioning.\r\n");
		AppAI_LogXspi2IndirectAndMappedPrefix();
		AppAI_LogXspi2MappedScaleBytes();
	} else {
		DebugConsole_Printf(
				"[AI] xSPI2 model image missing or stale; programming from SD card.\r\n");
		if (!AppAI_EnsureXspi2MemoryReady()) {
			AppAI_LogXspi2LoadFailure("xSPI2 memory", FX_SUCCESS,
					BSP_ERROR_COMPONENT_FAILURE);
			return false;
		}

		if (!AppAI_ProgramXspi2ModelImageFromSd()) {
			DebugConsole_Printf(
					"[AI] xSPI2 model image provisioning failed.\r\n");
			return false;
		}
	}

	if (!AppAI_Xspi2ModelImageMatchesMappedFlash()) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed after provisioning.\r\n");
	}

	app_ai_xspi2_initialized = true;
	DebugConsole_Printf("[AI] xSPI2 model image ready.\r\n");
	return true;
}

bool App_AI_Model_Init(void) {
	if (app_ai_runtime_initialized) {
		return true;
	}

	if (!AppAI_EnsureNpuHardwareReady()) {
		AppAI_LogInitFailure("NPU hardware");
		return false;
	}

	if (!AppAI_EnsureXspi2MemoryReady()) {
		AppAI_LogInitFailure("XSPI2 memory");
		return false;
	}

	if (!AppAI_EnsureXspi2ModelImageReady()) {
		AppAI_LogInitFailure("xSPI2 model image");
		return false;
	}

	if (!AppAI_RuntimeInitStepwise()) {
		AppAI_LogInitFailure("runtime init");
		return false;
	}

	if (!LL_ATON_EC_Network_Init_mobilenetv2_scalar_hardcase_warmstart_int8()) {
		AppAI_LogInitFailure("network init");
		return false;
	}
	LL_ATON_RT_Init_Network(
			&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	if (!LL_ATON_EC_Inference_Init_mobilenetv2_scalar_hardcase_warmstart_int8()) {
		AppAI_LogInitFailure("inference init");
		return false;
	}

	app_ai_runtime_initialized = true;
	DebugConsole_Printf("[AI] Model runtime init OK.\r\n");
	return true;
}

static void AppAI_LogInitFailure(const char *step) {
	if (step != NULL) {
		DebugConsole_Printf("[AI] Model runtime init failed at %s.\r\n", step);
	} else {
		DebugConsole_Printf("[AI] Model runtime init failed.\r\n");
	}
}

static void AppAI_LogXspi2LoadFailure(const char *step, UINT fx_status,
		int32_t bsp_status) {
	DebugConsole_Printf("[AI] xSPI2 load failed at %s (fx=%lu bsp=%ld).\r\n",
			(step != NULL) ? step : "unknown",
			(unsigned long) fx_status,
			(long) bsp_status);
}

static void AppAI_LogXspi2ProgramChunkProgress(ULONG chunk_index,
		ULONG flash_offset, ULONG chunk_size) {
	DebugConsole_Printf(
			"[AI] xSPI2 program chunk %lu offset=0x%08lX size=%lu.\r\n",
			(unsigned long) chunk_index,
			(unsigned long) flash_offset,
			(unsigned long) chunk_size);
}

static void AppAI_LogXspi2FlashPrefix(void) {
	uint8_t flash_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };

	if (BSP_XSPI_NOR_Read(0U, flash_bytes, 0U,
			APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 prefix readback failed.\r\n");
		return;
	}

	AppAI_LogXspi2PrefixBytes("xSPI2 prefix readback:", flash_bytes);
}

static void AppAI_LogXspi2MappedScaleBytes(void) {
	const uint8_t *const scale_ptr = (const uint8_t *) (0x70000000UL
			+ APP_AI_XSPI2_SCALE_OFFSET);

	(void) mcu_cache_invalidate_range((uint32_t) (uintptr_t) scale_ptr,
			(uint32_t) ((uintptr_t) scale_ptr + 4U));

	DebugConsole_Printf(
			"[AI] xSPI2 mapped scale bytes @%p = %02X %02X %02X %02X\r\n",
			(const void *) scale_ptr, scale_ptr[0], scale_ptr[1], scale_ptr[2],
			scale_ptr[3]);
}

static void AppAI_LogXspi2IndirectAndMappedPrefix(void) {
	uint8_t indirect_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	uint8_t mapped_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	const int32_t disable_status = BSP_XSPI_NOR_DisableMemoryMappedMode(0U);

	if (disable_status != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[AI] xSPI2 disable-mapped before compare returned %ld.\r\n",
				(long) disable_status);
	}

	if (BSP_XSPI_NOR_Read(0U, indirect_bytes, 0U,
			APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 indirect prefix read failed.\r\n");
	} else {
		AppAI_LogXspi2PrefixBytes("xSPI2 indirect prefix:", indirect_bytes);
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 re-enable mapped compare failed.\r\n");
		return;
	}

	(void) mcu_cache_invalidate_range(0x70000000UL,
			0x70000000UL + APP_AI_XSPI2_PROBE_BYTES);
	(void) memcpy(mapped_bytes, (const void *) 0x70000000UL,
			APP_AI_XSPI2_PROBE_BYTES);
	AppAI_LogXspi2PrefixBytes("xSPI2 mapped prefix:", mapped_bytes);
}

static void AppAI_LogFloatApprox(const char *label, float value) {
	union {
		float f;
		uint32_t u;
	} bits = {
		.f = value
	};
	unsigned long magnitude_whole = 0U;
	unsigned long magnitude_frac = 0U;
	const char *sign = "";
	double abs_value = 0.0;

	if (label == NULL) {
		return;
	}

	if ((bits.u & 0x7F800000U) == 0x7F800000U) {
		if ((bits.u & 0x007FFFFFU) != 0U) {
			DebugConsole_Printf("%sNaN\r\n", label);
		} else if ((bits.u & 0x80000000U) != 0U) {
			DebugConsole_Printf("%s-Inf\r\n", label);
		} else {
			DebugConsole_Printf("%s+Inf\r\n", label);
		}
		return;
	}

	if ((bits.u & 0x80000000U) != 0U) {
		sign = "-";
	}

