rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	abs_value = (bits.u & 0x80000000U) != 0U ? -(double) value : (double) value;
	if (abs_value < 0.0) {
		abs_value = 0.0;
	}

	magnitude_whole = (unsigned long) abs_value;
	magnitude_frac = (unsigned long) ((abs_value - (double) magnitude_whole)
			* 1000000.0 + 0.5);
	if (magnitude_frac >= 1000000U) {
		magnitude_whole++;
		magnitude_frac -= 1000000U;
	}

	DebugConsole_Printf("%s%s%lu.%06lu\r\n", label, sign,
			magnitude_whole, magnitude_frac);
}

static bool AppAI_RuntimeInitStepwise(void) {
	uint32_t t = 0U;

	/* Let the vendor runtime perform the low-level ATON bring-up and version
	 * compatibility checks. Our wrapper only handles the OSAL and IRQ setup. */
	if (LL_ATON_Init() != LL_ATON_OK) {
		return false;
	}

	ATON_DISABLE_CLR_CONFCLR(INTCTRL, 0);
	ATON_INTCTRL_STD_INTORMSK_SET(ATON_STRENG_INT_MASK(ATON_STRENG_NUM, 0, 0));
	ATON_INTCTRL_STD_INTANDMSK_SET(0xFFFFFFFFU);
#if (ATON_INT_NR > 32)
	ATON_INTCTRL_STD_INTORMSK_H_SET(0xFFFFFFFFU);
	ATON_INTCTRL_STD_INTANDMSK_H_SET(0xFFFFFFFFU);
#endif
	ATON_ENABLE(INTCTRL, 0);

	LL_ATON_OSAL_INIT();

	LL_ATON_OSAL_DISABLE_IRQ(0U);
	LL_ATON_OSAL_DISABLE_IRQ(1U);
	LL_ATON_OSAL_DISABLE_IRQ(2U);
	LL_ATON_OSAL_DISABLE_IRQ(3U);

	LL_ATON_OSAL_ENABLE_IRQ(ATON_STD_IRQ_LINE);
	return true;
}

static void AppAI_ConfigureNpuAccessControl(void) {
	RIMC_MasterConfig_t npu_master = { 0 };

	/* Mirror the ST NPU examples so the runtime can access the cache and NPU
	 * control path with the expected secure/privileged attributes. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();
	__HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();

	/* The secure NPU validation app programs the NPU as secure + privileged.
	 * That matches our secure-side runtime more closely than the earlier NSEC
	 * experiment, and it avoids blocking the internal ATON control window. */
	npu_master.MasterCID = RIF_CID_1;
	npu_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
	HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &npu_master);
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU,
			RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);

#if defined(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHEAXIRAM,
			RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif

#if defined(RIF_RCC_PERIPH_INDEX_CACHECONFIG)
	HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_CACHECONFIG,
			RIF_ATTRIBUTE_PRIV | RIF_ATTRIBUTE_SEC);
#endif
}

static void AppAI_EnableNpuMemoryAndCaches(void) {
	/* Mirror the ST NPU examples so the memory fabric is actually usable by
	 * the runtime before the first ATON init call runs. */
	RCC->MEMENR |= RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN
			| RCC_MEMENR_AXISRAM5EN | RCC_MEMENR_AXISRAM6EN
			| RCC_MEMENR_CACHEAXIRAMEN;

	RAMCFG_SRAM2_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM3_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM4_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM5_AXI->CR &= ~RAMCFG_CR_SRAMSD;
	RAMCFG_SRAM6_AXI->CR &= ~RAMCFG_CR_SRAMSD;

	MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk | MEMSYSCTL_MSCR_ICACTIVE_Msk;
}

static uint32_t AppAI_GetRisafMaxAddr(RISAF_TypeDef *risaf) {
	uint32_t max_addr = 0U;

	if ((risaf == RISAF1_S) || (risaf == RISAF1_NS)) {
		max_addr = RISAF1_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF2_S) || (risaf == RISAF2_NS)) {
		max_addr = RISAF2_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF3_S) || (risaf == RISAF3_NS)) {
		max_addr = RISAF3_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF4_S) || (risaf == RISAF4_NS)) {
		max_addr = RISAF4_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF5_S) || (risaf == RISAF5_NS)) {
		max_addr = RISAF5_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF6_S) || (risaf == RISAF6_NS)) {
		max_addr = RISAF6_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF7_S) || (risaf == RISAF7_NS)) {
		max_addr = RISAF7_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF8_S) || (risaf == RISAF8_NS)) {
		max_addr = RISAF8_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF9_S) || (risaf == RISAF9_NS)) {
		max_addr = RISAF9_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF11_S) || (risaf == RISAF11_NS)) {
		max_addr = RISAF11_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF12_S) || (risaf == RISAF12_NS)) {
		max_addr = RISAF12_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF13_S) || (risaf == RISAF13_NS)) {
		max_addr = RISAF13_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF14_S) || (risaf == RISAF14_NS)) {
		max_addr = RISAF14_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF15_S) || (risaf == RISAF15_NS)) {
		max_addr = RISAF15_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF21_S) || (risaf == RISAF21_NS)) {
		max_addr = RISAF21_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF22_S) || (risaf == RISAF22_NS)) {
		max_addr = RISAF22_LIMIT_ADDRESS_SPACE_SIZE;
	} else if ((risaf == RISAF23_S) || (risaf == RISAF23_NS)) {
		max_addr = RISAF23_LIMIT_ADDRESS_SPACE_SIZE;
	}

	return max_addr;
}

static void AppAI_SetRisafDefault(RISAF_TypeDef *risaf) {
	RISAF_BaseRegionConfig_t risaf_conf;
	RISAF_TypeDef *const risaf_hw = (risaf == RISAF12_S) ? RISAF12_NS : risaf;

	risaf_conf.StartAddress = 0x0U;
	risaf_conf.EndAddress = AppAI_GetRisafMaxAddr(risaf_hw);
	risaf_conf.Filtering = RISAF_FILTER_ENABLE;
	risaf_conf.PrivWhitelist = RIF_CID_NONE;
	risaf_conf.ReadWhitelist = RIF_CID_MASK;
	risaf_conf.WriteWhitelist = RIF_CID_MASK;

	risaf_conf.Secure = RIF_ATTRIBUTE_SEC;
	if (risaf == RISAF12_S) {
		
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 0U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}

	risaf_conf.Secure = RIF_ATTRIBUTE_NSEC;
	if (risaf == RISAF12_S) {
		
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 1U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}
}

static void AppAI_ConfigureNpuRisafDefaults(void) {
	/* Keep the default ST security model so the AI runtime can reach the memory
	 * and fabric regions it expects during LL_ATON startup. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();

	
