rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	AppAI_SetRisafDefault(RISAF2_S);
	

	
	AppAI_SetRisafDefault(RISAF3_S);
	

	
	AppAI_SetRisafDefault(RISAF4_S);
	

	
	AppAI_SetRisafDefault(RISAF5_S);
	

	
	AppAI_SetRisafDefault(RISAF6_S);
	

	
	AppAI_SetRisafDefault(RISAF7_S);
	

	/* RISAF12 programming currently stalls on this board even though the
	 * xSPI2 memory-mapped window is already enabled. Leave it untouched for
	 * now so we can validate whether the runtime can proceed without it. */
	

#if defined(RISAF8_S) && defined(RISAF15_S)
	
	AppAI_SetRisafDefault(RISAF8_S);
	AppAI_SetRisafDefault(RISAF15_S);
	
#endif
}

bool App_AI_RunDryInferenceFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size) {
	const LL_Buffer_InfoTypeDef *input_info = NULL;
	const LL_Buffer_InfoTypeDef *output_info = NULL;
	float *input_ptr = NULL;
	const float *output_ptr = NULL;
	size_t input_len_bytes = 0U;
	size_t input_float_count = 0U;
	size_t output_len_bytes = 0U;

	if (!App_AI_Model_Init()) {
		
		return false;
	}

	input_info = AppAI_GetInputBufferInfo();
	output_info = AppAI_GetOutputBufferInfo();
	if ((input_info == NULL) || (output_info == NULL)) {
		
		return false;
	}

	input_ptr = (float *) LL_Buffer_addr_start(input_info);
	input_len_bytes = (size_t) LL_Buffer_len(input_info);
	input_float_count = input_len_bytes / sizeof(float);
	if (input_ptr == NULL) {
		
		return false;
	}

	if (!AppAI_PreprocessYuv422FrameToFloatInput(frame_bytes, frame_size,
			input_ptr, input_float_count)) {
		return false;
	}

	AppAI_LogFrameSignature(frame_bytes, frame_size);
	AppAI_LogInputSignature(input_ptr, input_float_count);

	/* Make sure the NPU sees the freshly prepared float input. */
	(void) mcu_cache_clean_range((uint32_t) (uintptr_t) input_ptr,
			(uint32_t) ((uintptr_t) input_ptr + input_len_bytes));

	AppAI_LogXspi2MappedScaleBytes();

	LL_ATON_RT_Reset_Network(&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	for (uint32_t epoch_step = 0U;; ++epoch_step) {
		

		const LL_ATON_RT_RetValues_t run_status = LL_ATON_RT_RunEpochBlock(
				&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

		

		if (run_status == LL_ATON_RT_DONE) {
			break;
		}

		/* Follow the ATON runtime contract so the NPU can wait on its own event. */
		if (run_status == LL_ATON_RT_WFE) {
			
			LL_ATON_OSAL_WFE();
			
		} else {
			tx_thread_relinquish();
		}
	}

	output_ptr = (const float *) LL_Buffer_addr_start(output_info);
	output_len_bytes = (size_t) LL_Buffer_len(output_info);
	if ((output_ptr == NULL) || (output_len_bytes < sizeof(float))) {
		
		return false;
	}

	/* Read the scalar output back after the runtime finishes. */
	(void) mcu_cache_invalidate_range((uint32_t) (uintptr_t) output_ptr,
			(uint32_t) ((uintptr_t) output_ptr + output_len_bytes));

	AppAI_LogInferenceResult(output_info);

	return true;
}

/* USER CODE END 0 */

/* USER CODE BEGIN 1 */

static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *input_info =
			LL_ATON_Input_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	if ((input_info == NULL) || (input_info->name == NULL)) {
		return NULL;
	}

	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *output_info =
			LL_ATON_Output_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	if ((output_info == NULL) || (output_info->name == NULL)) {
		return NULL;
	}

	return output_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *name) {
	if ((buffer_list == NULL) || (name == NULL)) {
		return NULL;
	}

	for (const LL_Buffer_InfoTypeDef *entry = buffer_list; entry->name != NULL;
			++entry) {
		if (strcmp(entry->name, name) == 0) {
			return entry;
		}
	}

	return NULL;
}

static void AppAI_LogInferenceResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info) {
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *raw_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scale_info = NULL;
	const LL_Buffer_InfoTypeDef *zero_point_info = NULL;
	const uint8_t *scale_bytes = NULL;
	union {
		float f;
		uint32_t u;
	} output_bits = {
		.f = 0.0f
	};
	int8_t raw_output_value = 0;
	int8_t dequant_zero_point = 0;

	if (output_buffer_info == NULL) {
		DebugConsole_Printf("[AI] Inference failed: no output buffer.\r\n");
		return;
	}

	(void) memcpy(&output_bits.u, LL_Buffer_addr_start(output_buffer_info),
			sizeof(output_bits.u));

	internal_buffers =
			LL_ATON_Internal_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);
	raw_output_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Gemm_259_out_0");
	scale_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Dequantize_261_x_scale");
	zero_point_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Dequantize_261_x_zero_point");

	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL)) {
		raw_output_value = *(const int8_t *) LL_Buffer_addr_start(raw_output_info);
	}

	if ((scale_info != NULL) && (LL_Buffer_addr_start(scale_info) != NULL)) {
		scale_bytes = (const uint8_t *) LL_Buffer_addr_start(scale_info);
	}

	if ((zero_point_info != NULL)
			&& (LL_Buffer_addr_start(zero_point_info) != NULL)) {
		dequant_zero_point = *(const int8_t *) LL_Buffer_addr_start(
				zero_point_info);
	}

	DebugConsole_Printf(
			"[AI] Inference OK; raw=%d output_bits=0x%08lx zp=%d\r\n",
			(int) raw_output_value,
			(unsigned long) output_bits.u,
			(int) dequant_zero_point);
	AppAI_LogFloatApprox("[AI] Inference output value: ", output_bits.f);
	app_ai_last_inference_value = output_bits.f;
	app_ai_last_inference_valid = true;

	if (scale_bytes != NULL) {
		DebugConsole_Printf("[AI] Dequant scale bytes @%p = %02x %02x %02x %02x\r\n",
				(const void *) scale_bytes,
				(unsigned int) scale_bytes[0],
				(unsigned int) scale_bytes[1],
				(unsigned int) scale_bytes[2],
				(unsigned int) scale_bytes[3]);
	}
}

static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
		bool clean, bool invalidate) {
	uintptr_t start = 0U;
	uintptr_t end = 0U;

	if (end_addr <= start_addr) {
		return -1;
	}

	start = (uintptr_t) start_addr;
	end = (uintptr_t) end_addr;

