rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	start &= ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);
	end = (end + APP_AI_CACHE_LINE_BYTES - 1U)
			& ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);

	if (clean) {
		SCB_CleanDCache_by_Addr((uint32_t *) start, (int32_t) (end - start));
	}

	if (invalidate) {
		SCB_InvalidateDCache_by_Addr((uint32_t *) start,
				(int32_t) (end - start));
	}

	return 0;
}

static bool AppAI_PreprocessYuv422FrameToFloatInput(const uint8_t *frame_bytes,
		size_t frame_size, float *input_ptr, size_t input_float_count) {
	if ((frame_bytes == NULL) || (input_ptr == NULL)) {
		
		return false;
	}

	if ((frame_size < (size_t) APP_AI_CAPTURE_FRAME_BYTES)
			|| (input_float_count < (size_t) APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		
		return false;
	}

	/* Convert each 2-byte YUV422 sample pair into a grayscale RGB triplet.
	 * This keeps the first dry-run simple while still exercising the real model
	 * runtime on the captured frame contents. */
	for (size_t pixel_index = 0U;
			pixel_index < (size_t) (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS
					* APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS); pixel_index++) {
		const size_t source_index = pixel_index * 2U;
		const float gray = ((float) frame_bytes[source_index]
				+ (float) frame_bytes[source_index + 1U]) * 0.5f
				/ 255.0f;
		const size_t dest_index = pixel_index * 3U;

		input_ptr[dest_index + 0U] = gray;
		input_ptr[dest_index + 1U] = gray;
		input_ptr[dest_index + 2U] = gray;
	}

	return true;
}

bool App_AI_GetLastInferenceResult(float *value_out) {
	if (value_out == NULL) {
		return false;
	}
	if (!app_ai_last_inference_valid) {
		return false;
	}
	*value_out = app_ai_last_inference_value;
	return true;
}

/* USER CODE END 1 */
